

const ageExperienceOptions = ['2-6 μηνών', '6-12 μηνών', '1-2 ετών', '> 2 ετών'];
const specializationOptions = ['ΑμεΑ', 'Νοηματική'];

const educationSpecialties = {
  "Τίτλοι δευτεροβάθμιας Επαγγελματικής Εκπαίδευσης": [
    "Πτυχίο ΕΠΑΛ της ειδικότητας «Βοηθός Βρεφονηπιοκόμων» επίπεδο 4 ΕΠΠ ή ισότιμος τίτλος",
    "Πτυχίο Τεχνικού Επαγγελματικού Λυκείου (ΤΕΛ) του τομέα Κοινωνικών Υπηρεσιών, Τμήματος Βοηθών Βρεφονηπιοκόμων Παιδοκόμων ή ισότιμος τίτλος",
    "Πτυχίο του Τμήματος Ειδίκευσης συναφούς ειδικότητας του Κλάδου Κοινωνικής Πρόνοιας Ενιαίου Πολυκλαδικού Λυκείου (ΕΠΛ) ή ισότιμος τίτλος",
    "Πτυχίο Τεχνικού Επαγγελματικού Εκπαιδευτηρίου (ΤΕΕ) Β’ Κύκλου της ειδικότητας Βοηθός Βρεφονηπιοκόμων ή ισότιμος τίτλος",
    "Πτυχίο ΕΠΑΣ μαθητείας ΟΑΕΔ ειδικότητας «Βοηθός Γενικής Βρεφονηπιοκομίας» επίπεδο 4 ΕΠΠ ή ισότιμος τίτλος",
    "Πτυχίο Τεχνικού Επαγγελματικού Εκπαιδευτηρίου (ΤΕΕ) Α’ Κύκλου της ειδικότητας",
    "Βοηθός Βρεφονηπιοκόμων ή ισότιμος τίτλος",
    "Διαδικτυακή εκπαίδευση",
  ],
  "Τίτλοι επαγγελματικής Εκπαίδευσης/Κατάρτισης": [
    "Πτυχίο ΕΠΑΣ μαθητείας ΟΑΕΔ ειδικότητας «Βοηθός Γενικής Βρεφονηπιοκομίας» επίπεδο 3 ή ισότιμος τίτλος",
    "Διαδικτυακή εκπαίδευση",
  ],
  "Τίτλοι ανώτατης Εκπαίδευσης": [
    "Πτυχίο ΑΕΙ Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Τμήμα Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Σχολή Διοικητικών, Οικονομικών και Κοινωνικών Επιστημών/ Πανεπιστήμιο Δυτικής Αττικής ή ισότιμος τίτλος",
    "Πτυχίο ΑΕΙ Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Τμήμα Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Σχολή Κοινωνικών Επιστημών/ Διεθνές Πανεπιστήμιο της Ελλάδας ή ισότιμος τίτλος",
    "Πτυχίο ΑΕΙ Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Τμήμα Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Σχολή Κοινωνικών Επιστημών/ Πανεπιστήμιο Ιωαννίνων ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Προσχολικής Αγωγής/ Τμήμα Προσχολικής Αγωγής/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Αθήνας ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Προσχολικής Αγωγής/ Τμήμα Προσχολικής Αγωγής/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Προσχολικής Αγωγής/ Τμήμα Προσχολικής Αγωγής/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Ηπείρου ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Βρεφονηπιοκομίας/ Τμήμα Βρεφονηπιοκομίας/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Αθήνας ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Βρεφονηπιοκομίας/ Τμήμα Βρεφονηπιοκομίας/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Θεσσαλονίκης ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Βρεφονηπιοκομίας/ Τμήμα Βρεφονηπιοκομίας/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Ηπείρου ή ισότιμος τίτλος",
    "Πτυχίο Ανώτερας Σχολής Νηπιοβρεφοκόμων του Κέντρου Βρεφών «Η ΜΗΤΕΡΑ»",
    "Πτυχίο Ανώτερας Σχολής Νηπιοβρεφοκόμων του ΠΙΚΠΑ Ιωαννίνων",
    "Διαδικτυακή εκπαίδευση",
  ],
};

const educationLevels = Object.keys(educationSpecialties).map((level) => ({
  value: level,
  label: level,
}));

const languageOptions = [
  { value: 'english', label: 'Αγγλικά' },
  { value: 'french', label: 'Γαλλικά' },
  { value: 'italian', label: 'Ιταλικά' },
  { value: 'spanish', label: 'Ισπανικά' },
  { value: 'german', label: 'Γερμανικά' },
  { value: 'russian', label: 'Ρώσικα' },
  { value: 'arabic', label: 'Αραβικά' },
];


const experienceOptions = [
  { value: "Καμία προϋπηρεσία", label: "Καμία προϋπηρεσία" },
  { value: "1 έτος", label: "1 έτος" },
  { value: "2 έτη", label: "2 έτη" },
  { value: "3 έτη", label: "3 έτη" },
  { value: "4 έτη", label: "4 έτη" },
  { value: "5 έτη", label: "5 έτη" },
  { value: "5-10 έτη", label: "5-10 έτη" },
  { value: "10+ έτη", label: "10+ έτη" },
];

export {
  ageExperienceOptions,
  specializationOptions,
  educationSpecialties,
  educationLevels,
  experienceOptions,
  languageOptions
};