

const ageExperienceOptions = ['2-6 μηνών', '6-12 μηνών', '1-2 ετών', '> 2 ετών'];
const specializationOptions = [{label: 'ΑμεΑ', name: 'specialNeeds'}, {label: 'Νοηματική', name: 'asl'}];

const educationSpecialties = {
  "Δευτεροβάθμια Εκπαίδευση": [
    "Πτυχίο ΕΠΑΛ της ειδικότητας «Βοηθός Βρεφονηπιοκόμων» επίπεδο 4 ΕΠΠ ή ισότιμος τίτλος",
    "Πτυχίο Τεχνικού Επαγγελματικού Λυκείου (ΤΕΛ) του τομέα Κοινωνικών Υπηρεσιών, Τμήματος Βοηθών Βρεφονηπιοκόμων Παιδοκόμων ή ισότιμος τίτλος",
    "Πτυχίο του Τμήματος Ειδίκευσης συναφούς ειδικότητας του Κλάδου Κοινωνικής Πρόνοιας Ενιαίου Πολυκλαδικού Λυκείου (ΕΠΛ) ή ισότιμος τίτλος",
    "Πτυχίο Τεχνικού Επαγγελματικού Εκπαιδευτηρίου (ΤΕΕ) Β’ Κύκλου της ειδικότητας Βοηθός Βρεφονηπιοκόμων ή ισότιμος τίτλος",
    "Πτυχίο ΕΠΑΣ μαθητείας ΟΑΕΔ ειδικότητας «Βοηθός Γενικής Βρεφονηπιοκομίας» επίπεδο 4 ΕΠΠ ή ισότιμος τίτλος",
    "Πτυχίο Τεχνικού Επαγγελματικού Εκπαιδευτηρίου (ΤΕΕ) Α’ Κύκλου της ειδικότητας",
    "Βοηθός Βρεφονηπιοκόμων ή ισότιμος τίτλος",
    "Διαδικτυακή εκπαίδευση",
  ],
  "Επαγγελματικής Εκπαίδευση/Κατάρτιση": [
    "Πτυχίο ΕΠΑΣ μαθητείας ΟΑΕΔ ειδικότητας «Βοηθός Γενικής Βρεφονηπιοκομίας» επίπεδο 3 ή ισότιμος τίτλος",
    "Διαδικτυακή εκπαίδευση",
  ],
  "Ανώτατη Εκπαίδευση": [
    "Πτυχίο ΑΕΙ Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Τμήμα Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Σχολή Διοικητικών, Οικονομικών και Κοινωνικών Επιστημών/ Πανεπιστήμιο Δυτικής Αττικής ή ισότιμος τίτλος",
    "Πτυχίο ΑΕΙ Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Τμήμα Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Σχολή Κοινωνικών Επιστημών/ Διεθνές Πανεπιστήμιο της Ελλάδας ή ισότιμος τίτλος",
    "Πτυχίο ΑΕΙ Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Τμήμα Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία/ Σχολή Κοινωνικών Επιστημών/ Πανεπιστήμιο Ιωαννίνων ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Προσχολικής Αγωγής/ Τμήμα Προσχολικής Αγωγής/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Αθήνας ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Προσχολικής Αγωγής/ Τμήμα Προσχολικής Αγωγής/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ Αλεξάνδρειο Τεχνολογικό Εκπαιδευτικό Ίδρυμα Θεσσαλονίκης ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Προσχολικής Αγωγής/ Τμήμα Προσχολικής Αγωγής/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Ηπείρου ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Βρεφονηπιοκομίας/ Τμήμα Βρεφονηπιοκομίας/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Αθήνας ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Βρεφονηπιοκομίας/ Τμήμα Βρεφονηπιοκομίας/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Θεσσαλονίκης ή ισότιμος τίτλος",
    "Πτυχίο ΤΕΙ Βρεφονηπιοκομίας/ Τμήμα Βρεφονηπιοκομίας/ Σχολή Επαγγελμάτων Υγείας και Πρόνοιας/ ΤΕΙ Ηπείρου ή ισότιμος τίτλος",
    "Πτυχίο Ανώτερας Σχολής Νηπιοβρεφοκόμων του Κέντρου Βρεφών «Η ΜΗΤΕΡΑ»",
    "Πτυχίο Ανώτερας Σχολής Νηπιοβρεφοκόμων του ΠΙΚΠΑ Ιωαννίνων",
    "Διαδικτυακή εκπαίδευση",
  ],
};

const educationLevels = Object.keys(educationSpecialties).map((level) => ({
  value: level,
  label: level,
}));

const genderOptions = [
  { value: 'male', label: 'Άντρας' },
  { value: 'female', label: 'Γυναίκα' },
];

const ageOptions = Array.from({ length: 52 }, (_, idx) => ({ value: idx+18, label: idx+18 }));

const cityOptions = [
  { value: "ΔΗΜΟΣ ΠΕΙΡΑΙΩΣ", label: "ΔΗΜΟΣ ΠΕΙΡΑΙΩΣ" },
  { value: "ΔΗΜΟΣ ΚΑΛΛΙΘΕΑΣ", label: "ΔΗΜΟΣ ΚΑΛΛΙΘΕΑΣ" },
  { value: "ΔΗΜΟΣ ΑΧΑΡΝΕΣ", label: "ΔΗΜΟΣ ΑΧΑΡΝΕΣ" },
];

const cityNeighborhoods = {
  "ΔΗΜΟΣ ΠΕΙΡΑΙΩΣ": [
    { value: "Καμίνια", label: "Καμίνια" },
    { value: "Καλλίπολη", label: "Καλλίπολη" },
    { value: "Αγία Σοφία", label: "Αγία Σοφία" },
    { value: "Πειραϊκή", label: "Πειραϊκή" },
    { value: "Καστέλλα", label: "Καστέλλα" },
    { value: "Μανιάτικα", label: "Μανιάτικα" },
    { value: "Νέο Φάληρο", label: "Νέο Φάληρο" },
    { value: "Τερψιθέα", label: "Τερψιθέα" },
    { value: "Ταμπούρια", label: "Ταμπούρια" },
    { value: "Προφήτης Ηλίας", label: "Προφήτης Ηλίας" },
  ],
  "ΔΗΜΟΣ ΚΑΛΛΙΘΕΑΣ": [
    { value: "Τζιτζιφιές", label: "Τζιτζιφιές" },
    { value: "Αγία Ελεούσα", label: "Αγία Ελεούσα" },
    { value: "Ιππόδρομος", label: "Ιππόδρομος" },
    { value: "Χαροκόπου", label: "Χαροκόπου" },
    { value: "Μεταμόρφωση", label: "Μεταμόρφωση" },
    { value: "Λόφος Φιλαρέτου", label: "Λόφος Φιλαρέτου" },
  ],
  "ΔΗΜΟΣ ΑΧΑΡΝΕΣ": [
    { value: "Ολυμπιακό Χωριό", label: "Ολυμπιακό Χωριό" },
    { value: "Χαραυγή", label: "Χαραυγή" },
    { value: "Βαρυμπόμπη", label: "Βαρυμπόμπη" },
    { value: "Λαθέα", label: "Λαθέα" },
    { value: "Παλαιό Μενίδι", label: "Παλαιό Μενίδι" },
    { value: "Άγιος Πέτρος", label: "Άγιος Πέτρος" },
    { value: "Τατόι", label: "Τατόι" },
  ],
};

const nationalityOptions = [
  { value: 'Ελληνική', label: 'Ελληνική' },
  { value: 'Αμερικανική', label: 'Αμερικανική' },
  { value: 'Γαλλική', label: 'Γαλλική' },
  { value: 'Γερμανική', label: 'Γερμανική' },
  { value: 'Ιταλική', label: 'Ιταλική' },
  { value: 'Ισπανική', label: 'Ισπανική' },
  { value: 'Πορτογαλική', label: 'Πορτογαλική' },
  { value: 'Βρετανική', label: 'Βρετανική' },
  { value: 'Κινέζικη', label: 'Κινέζικη' },
  { value: 'Ιαπωνική', label: 'Ιαπωνική' },
  { value: 'Ινδική', label: 'Ινδική' },
  { value: 'Ρωσική', label: 'Ρωσική' },
  { value: 'Αυστραλιανή', label: 'Αυστραλιανή' },
  { value: 'Καναδική', label: 'Καναδική' },
  { value: 'Νορβηγική', label: 'Νορβηγική' },
  { value: 'Σουηδική', label: 'Σουηδική' },
  { value: 'Δανική', label: 'Δανική' },
  { value: 'Φινλανδική', label: 'Φινλανδική' },
  { value: 'Αλβανική', label: 'Αλβανική' },
  { value: 'Βουλγαρική', label: 'Βουλγαρική' },
  { value: 'Τουρκική', label: 'Τουρκική' },
  { value: 'Σκοπιανή', label: 'Σκοπιανή' },
  { value: 'Σερβική', label: 'Σερβική' },
  { value: 'Μαυροβουνιακή', label: 'Μαυροβουνιακή' },
  { value: 'Κροατική', label: 'Κροατική' },
  { value: 'Βοσνιακή', label: 'Βοσνιακή' },
  { value: 'Ρουμανική', label: 'Ρουμανική' },
  { value: 'Κυπριακή', label: 'Κυπριακή' },
];

const languageOptions = [
  { value: 'english', label: 'Αγγλικά' },
  { value: 'french', label: 'Γαλλικά' },
  { value: 'italian', label: 'Ιταλικά' },
  { value: 'spanish', label: 'Ισπανικά' },
  { value: 'german', label: 'Γερμανικά' },
  { value: 'russian', label: 'Ρώσικα' },
  { value: 'arabic', label: 'Αραβικά' },
];

const experienceOptions = [
  { value: "Καμία προϋπηρεσία", label: "Καμία προϋπηρεσία" },
  { value: "1 έτος", label: "1 έτος" },
  { value: "2 έτη", label: "2 έτη" },
  { value: "3 έτη", label: "3 έτη" },
  { value: "4 έτη", label: "4 έτη" },
  { value: "5 έτη", label: "5 έτη" },
  { value: "5-10 έτη", label: "5-10 έτη" },
  { value: "10+ έτη", label: "10+ έτη" },
];

const transportationOptions = [
  {value: "babysitterCar", label: "Με Ι.Χ. Νταντάς"},
  {value: "familyCar", label: "Με Ι.Χ. Οικογένειας"},
];

const servicesMapper = {
  'cooking': "Μαγείρεμα",
  'cleaning': "Καθαρισμός σπιτιού",
  'ironing': "Σιδέρωμα",
  "firstAid": "Α` βοήθειες",
  'babysitterCertificate': "Πιστοποίηση νταντάς",
  'homeworkHelp': "Βοήθεια με μαθήματα",
  'visits': "Εκδρομές / Επισκέψεις",
  'accompanyToActivities': "Συνοδεία σε Δραστηριότητες",
  'outsideActivities': "Δραστηριότητες Εξωτερικού Χώρου",
  'emergencyAvailability': "Έκτακτη Διαθεσιμότητα",
  'englishNativeSpeaker': "English native speaker",
  'hosting': "Φιλοξενία στην οικία μου"
};

const days = ["Δευτέρα", "Tρίτη", "Tετάρτη", "Πέμπτη", "Παρασκευή", "Σάββατο", "Κυριακή"];
const months = [
  "Ιανουαρίου", "Φεβρουαρίου", "Μαρτίου", "Απριλίου", "Μαΐου", "Ιουνίου", 
  "Ιουλίου", "Αυγούστου", "Σεπτεμβρίου", "Οκτωβρίου", "Νοεμβρίου", "Δεκεμβρίου"
];
const times = [
  "07:00 πμ",
  "08:00 πμ",
  "09:00 πμ",
  "10:00 πμ",
  "11:00 πμ",
  "12:00 μμ",
  "01:00 μμ",
  "02:00 μμ",
  "03:00 μμ",
  "04:00 μμ",
  "05:00 μμ",
  "06:00 μμ",
  "07:00 μμ",
  "08:00 μμ",
  "09:00 μμ",
  "10:00 μμ",
  "11:00 μμ",
];

export {
  ageExperienceOptions,
  specializationOptions,
  educationSpecialties,
  educationLevels,
  experienceOptions,
  languageOptions,
  transportationOptions,
  servicesMapper,
  genderOptions,
  ageOptions,
  cityOptions,
  cityNeighborhoods,
  nationalityOptions,
  days,
  months,
  times,
};